'use strict';

const drinkArr = [
  "Вид Алкоголя",
  "Абсент",
  "Айсвайн",
  "Аквавит",
  "Арак",
  "Арманьяк",
  "Архи",
  "Бальзам",
  "Бамбузе",
  "Билк",
  "Биттер",
  "Бренди",
  "Бурбон",
  "Вермут",
  "Вино",
  "Виски",
  "Водка",
  "Граппа",
  "Джин",
  "Игристое",
  "Кальвадос",
  "Кашаса",
  "Квас",
  "Киршвассер",
  "Коньяк",
  "Крамбамбуля",
  "Креман",
  "Кумыс",
  "Ликер/Настойка",
  "Лимончелло",
  "Мадера",
  "Малага",
  "Мамахуана",
  "Маотай",
  "Марсала",
  "Медостав",
  "Мастика",
  "Мескаль",
  "Метакса",
  "Наливка",
  "Пастис",
  "Перри",
  "Пиво",
  "Пино",
  "Писко",
  "Поммо",
  "Портвейн",
  "Пульке",
  "Ракия",
  "Ракы",
  "Речото",
  "Ром",
  "Саке",
  "Самбука",
  "Сётю",
  "Самогон",
  "Сато",
  "Сидр",
  "Сливовица",
  "Старка",
  "Тарасун",
  "Текила",
  "Тогба",
  "Токай",
  "Тутовка",
  "Узо",
  "Флок",
  "Ханди",
  "Ханшина",
  "Херес",
  "Хреновуха",
  "Хурэмгэ",
  "Цинар",
  "Чача",
  "Чича",
  "Шампанское",
  "Шнапс",
  "Ягати",]

module.exports = {
  async up(queryInterface, Sequelize) {
    await queryInterface.bulkInsert('Type_of_alcohols', drinkArr.map(drink => ({ name: drink, createdAt: new Date(), updatedAt: new Date() })), {});
  },

  async down(queryInterface, Sequelize) {
    /**
     * Add commands to revert seed here.
     *
     * Example:
     * await queryInterface.bulkDelete('People', null, {});
     */
    //  await queryInterface.bulkDelete('Type_of_alcohols', null, {});
  }
};



